---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsPathType.EndAtRiser
source: html/2c25b1cc-0b50-b659-c710-45cda63bbf9c.htm
---
# Autodesk.Revit.DB.Architecture.StairsPathType.EndAtRiser Property

Represents whether the stairs path ends at the riser.

## Syntax (C#)
```csharp
public bool EndAtRiser { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The StairsPathType is not fixed up direction so the data being set is not applicable.